print('''
   ***                 ***   
 *********           *********
************       ************
*************     *************
**************   **************
*************** ***************
 *******    *** ***    *******
  ******     *****     ******
   ******     ***     ******
   ******     ***     ******
     ******    *     ******
       ******  *   ******
         **************
           **********
             ******
               ***
                *

''')

print('''
    去他个鸟命！
    我命由我，不由天！
    是魔是仙，我自己决定！
    靠'自己'
''')

# 穿上单引号、双引号、三引号黄袍的内容就是字符串，无论引号里面内容是中文、英文、法文、数字、符号、甚至是火星文
movie = '美国队长2'
name = 'The Winter Soldier'
price = "7.14"
word = '''≡(▔﹏▔)≡'''
print(movie)
print(name)
print(price)
print(word)
